In [1]:
import numpy as np
import pandas as pd

In [2]:
sr = pd.Series(np.random.randn(5), index=['a','b','c','d','e'])
sr

a    0.947212
b    1.371441
c   -0.083996
d    0.134653
e    0.126705
dtype: float64

In [5]:
dict_data = {'a': 1,'b': 2,'c': 3}
dict_data

{'a': 1, 'b': 2, 'c': 3}

In [7]:
sr2 = pd.Series(dict_data)
sr2

a    1
b    2
c    3
dtype: int64

In [8]:
type(sr2)

pandas.core.series.Series

In [9]:
index = sr2.index
index

Index(['a', 'b', 'c'], dtype='object')

In [10]:
values = sr2.values
values

array([1, 2, 3], dtype=int64)

In [11]:
for i in range(3):
    print(sr2[i])

1
2
3

In [12]:
sr2['a']

1

In [14]:
sr2[:]

a    1
b    2
c    3
dtype: int64

# 2.Data Frame

In [16]:
dict_data = {'col0': [1,2,3],'col1': [4,5,6],'col2': [7,8,9]}
dict_data

{'col0': [1, 2, 3], 'col1': [4, 5, 6], 'col2': [7, 8, 9]}

In [17]:
df = pd.DataFrame(dict_data)
df

   col0  col1  col2
0     1     4     7
1     2     5     8
2     3     6     9

In [18]:
type(df)

pandas.core.frame.DataFrame

In [19]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [20]:
df.columns

Index(['col0', 'col1', 'col2'], dtype='object')

In [23]:
df.index = ['A','B','C']
df

   col0  col1  col2
A     1     4     7
B     2     5     8
C     3     6     9

In [24]:
df.columns = ['No','Stu_No','Height']
df

   No  Stu_No  Height
A   1       4       7
B   2       5       8
C   3       6       9

In [30]:
df2 = pd.DataFrame([[1,'202001','190'],[2,'202002','170']],index = ['부시','버'],columns = ['번호','학번','키'])
df2

    번호      학번    키
부시   1  202001  190
버    2  202002  170

In [37]:
df2.rename(columns={'번호' : 'No'},inplace = True)
df2

     No      학번    키
후보1   1  202001  190
후보2   2  202002  170

In [36]:
df2.rename(index={'부시' : '후보1','버' : '후보2'},inplace = True)
df2

     No      학번    키
후보1   1  202001  190
후보2   2  202002  170

In [38]:
df2.drop('후보1',inplace=True)
df2

     No      학번    키
후보2   2  202002  170

In [40]:
df2.drop('No',axis=1,inplace=True)

In [41]:
df2

         학번    키
후보2  202002  170

In [44]:
df2.loc['후보1'] = [202001,190] #행 추가
df2

         학번    키
후보2  202002  170
1    202001  190
후보1  202001  190